In [8]:
import pandas as pd

df = pd.read_csv("employee_sales_data.csv")
df

    emp_id      name department        city month  sales  salary
0        1    Sanjog         IT     Pokhara   Jan  12000   60000
1        2    Bikash         HR   Kathmandu   Jan   8000   45000
2        3      Sita    Finance      Butwal   Jan  15000   70000
3        4    Ramesh         IT  Biratnagar   Jan  20000   80000
4        5      Gita         HR    Lalitpur   Jan   9000   48000
5        6     Aarav    Finance     Pokhara   Jan  17000   75000
6        7     Nabin         IT   Kathmandu   Feb  13000   62000
7        8     Pooja         HR     Pokhara   Feb  10000   50000
8        9     Kiran    Finance   Kathmandu   Feb  16000   72000
9       10    Manish         IT      Butwal   Feb  14000   65000
10      11     Sujan         HR  Biratnagar   Feb   8500   46000
11      12     Anita    Finance    Lalitpur   Feb  15500   71000
12      13     Rohit         IT     Pokhara   Mar  18000   78000
13      14    Sunita         HR   Kathmandu   Mar   9500   49000
14      15      Amit    Finance      Butwal   Mar  16500   74000
15      16    Deepak         IT  Biratnagar   Mar  19000   80000
16      17     Rekha         HR    Lalitpur   Mar   8800   47000
17      18   Prakash    Finance     Pokhara   Mar  17200   76000
18      19     Suman         IT   Kathmandu   Apr  12500   61000
19      20     Nisha         HR     Pokhara   Apr  10200   50500
20      21     Arjun    Finance   Kathmandu   Apr  16800   74500
21      22     Binod         IT      Butwal   Apr  14500   66000
22      23    Kabita         HR  Biratnagar   Apr   9200   48000
23      24     Saroj    Finance    Lalitpur   Apr  15800   72000
24      25     Rajan         IT     Pokhara   May  18500   79000
25      26      Mina         HR   Kathmandu   May   9700   49500
26      27     Pawan    Finance      Butwal   May  16200   73500
27      28    Dinesh         IT  Biratnagar   May  19500   81000
28      29  Sharmila         HR    Lalitpur   May   9100   47500
29      30      Alok    Finance     Pokhara   May  17000   75500
30      31   Krishna         IT   Kathmandu   Jun  15000   68000
31      32     Sneha         HR     Pokhara   Jun  10500   52000

In [9]:
data = {
    "name": ["Sanjog", "Bikash", "Sita"],
    "salary": [60000, 45000, 70000]
}

df_new = pd.DataFrame(data)
df_new

     name  salary
0  Sanjog   60000
1  Bikash   45000
2    Sita   70000

In [13]:

print("------")
df_new.index

------

RangeIndex(start=0, stop=3, step=1)

In [14]:
df.index

RangeIndex(start=0, stop=32, step=1)

In [15]:
df.set_index("emp_id", inplace=True)
df

            name department        city month  sales  salary
emp_id
1         Sanjog         IT     Pokhara   Jan  12000   60000
2         Bikash         HR   Kathmandu   Jan   8000   45000
3           Sita    Finance      Butwal   Jan  15000   70000
4         Ramesh         IT  Biratnagar   Jan  20000   80000
5           Gita         HR    Lalitpur   Jan   9000   48000
6          Aarav    Finance     Pokhara   Jan  17000   75000
7          Nabin         IT   Kathmandu   Feb  13000   62000
8          Pooja         HR     Pokhara   Feb  10000   50000
9          Kiran    Finance   Kathmandu   Feb  16000   72000
10        Manish         IT      Butwal   Feb  14000   65000
11         Sujan         HR  Biratnagar   Feb   8500   46000
12         Anita    Finance    Lalitpur   Feb  15500   71000
13         Rohit         IT     Pokhara   Mar  18000   78000
14        Sunita         HR   Kathmandu   Mar   9500   49000
15          Amit    Finance      Butwal   Mar  16500   74000
16        Deepak         IT  Biratnagar   Mar  19000   80000
17         Rekha         HR    Lalitpur   Mar   8800   47000
18       Prakash    Finance     Pokhara   Mar  17200   76000
19         Suman         IT   Kathmandu   Apr  12500   61000
20         Nisha         HR     Pokhara   Apr  10200   50500
21         Arjun    Finance   Kathmandu   Apr  16800   74500
22         Binod         IT      Butwal   Apr  14500   66000
23        Kabita         HR  Biratnagar   Apr   9200   48000
24         Saroj    Finance    Lalitpur   Apr  15800   72000
25         Rajan         IT     Pokhara   May  18500   79000
26          Mina         HR   Kathmandu   May   9700   49500
27         Pawan    Finance      Butwal   May  16200   73500
28        Dinesh         IT  Biratnagar   May  19500   81000
29      Sharmila         HR    Lalitpur   May   9100   47500
30          Alok    Finance     Pokhara   May  17000   75500
31       Krishna         IT   Kathmandu   Jun  15000   68000
32         Sneha         HR     Pokhara   Jun  10500   52000

In [16]:
df["salary"]

emp_id
1     60000
2     45000
3     70000
4     80000
5     48000
6     75000
7     62000
8     50000
9     72000
10    65000
11    46000
12    71000
13    78000
14    49000
15    74000
16    80000
17    47000
18    76000
19    61000
20    50500
21    74500
22    66000
23    48000
24    72000
25    79000
26    49500
27    73500
28    81000
29    47500
30    75500
31    68000
32    52000
Name: salary, dtype: int64

In [17]:
df[["name", "department", "salary"]]

            name department  salary
emp_id
1         Sanjog         IT   60000
2         Bikash         HR   45000
3           Sita    Finance   70000
4         Ramesh         IT   80000
5           Gita         HR   48000
6          Aarav    Finance   75000
7          Nabin         IT   62000
8          Pooja         HR   50000
9          Kiran    Finance   72000
10        Manish         IT   65000
11         Sujan         HR   46000
12         Anita    Finance   71000
13         Rohit         IT   78000
14        Sunita         HR   49000
15          Amit    Finance   74000
16        Deepak         IT   80000
17         Rekha         HR   47000
18       Prakash    Finance   76000
19         Suman         IT   61000
20         Nisha         HR   50500
21         Arjun    Finance   74500
22         Binod         IT   66000
23        Kabita         HR   48000
24         Saroj    Finance   72000
25         Rajan         IT   79000
26          Mina         HR   49500
27         Pawan    Finance   73500
28        Dinesh         IT   81000
29      Sharmila         HR   47500
30          Alok    Finance   75500
31       Krishna         IT   68000
32         Sneha         HR   52000

In [19]:
df.loc[1]

name           Sanjog
department         IT
city          Pokhara
month             Jan
sales           12000
salary          60000
Name: 1, dtype: object

In [20]:
df.iloc[0:5]

          name department        city month  sales  salary
emp_id
1       Sanjog         IT     Pokhara   Jan  12000   60000
2       Bikash         HR   Kathmandu   Jan   8000   45000
3         Sita    Finance      Butwal   Jan  15000   70000
4       Ramesh         IT  Biratnagar   Jan  20000   80000
5         Gita         HR    Lalitpur   Jan   9000   48000

In [23]:
df.head() # first 5

          name department        city month  sales  salary
emp_id
1       Sanjog         IT     Pokhara   Jan  12000   60000
2       Bikash         HR   Kathmandu   Jan   8000   45000
3         Sita    Finance      Butwal   Jan  15000   70000
4       Ramesh         IT  Biratnagar   Jan  20000   80000
5         Gita         HR    Lalitpur   Jan   9000   48000

In [24]:
df.tail() # last 5

            name department        city month  sales  salary
emp_id
28        Dinesh         IT  Biratnagar   May  19500   81000
29      Sharmila         HR    Lalitpur   May   9100   47500
30          Alok    Finance     Pokhara   May  17000   75500
31       Krishna         IT   Kathmandu   Jun  15000   68000
32         Sneha         HR     Pokhara   Jun  10500   52000

In [27]:
df.iloc[5:15, 0:6] # front ko list # back ko data
#slicing

          name department        city month  sales  salary
emp_id
6        Aarav    Finance     Pokhara   Jan  17000   75000
7        Nabin         IT   Kathmandu   Feb  13000   62000
8        Pooja         HR     Pokhara   Feb  10000   50000
9        Kiran    Finance   Kathmandu   Feb  16000   72000
10      Manish         IT      Butwal   Feb  14000   65000
11       Sujan         HR  Biratnagar   Feb   8500   46000
12       Anita    Finance    Lalitpur   Feb  15500   71000
13       Rohit         IT     Pokhara   Mar  18000   78000
14      Sunita         HR   Kathmandu   Mar   9500   49000
15        Amit    Finance      Butwal   Mar  16500   74000

In [28]:
df[(df["department"] == "IT") & (df["sales"] > 15000)]
# filtering the data

          name department        city month  sales  salary
emp_id
4       Ramesh         IT  Biratnagar   Jan  20000   80000
13       Rohit         IT     Pokhara   Mar  18000   78000
16      Deepak         IT  Biratnagar   Mar  19000   80000
25       Rajan         IT     Pokhara   May  18500   79000
28      Dinesh         IT  Biratnagar   May  19500   81000